app/controllers/devonshires_controller.rb

  def index
    @devonshires = Devonshire.all
---
SELECT * FROM `devonshires`

  def publiclist

    @devonshires = Devonshire.paginate :page => params[:page], :per_page => 4
---
SELECT * FROM "devonshires" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "devonshires"

  def edit
    @devonshire = Devonshire.find(params[:id])
---
SELECT * FROM "devonshires" WHERE ("devonshires"."id" = 1)

  def create
    @devonshire = Devonshire.new(params[:devonshire])

    respond_to do |format|
      if @devonshire.save
---
INSERT INTO "devonshires" ("photo_file_size", "created_at", "title", "photo_file_name", "updated_at", "photo_content_type", "description") VALUES(2444846, '2010-02-12 17:37:21', 'It All Start With The Wood', 'IMG_0091.JPG', '2010-02-12 17:37:21', 'image/jpeg', 'This is where the process begins! Ebony for the fingerboard, maple for the neck, mahogany for the body and figured myrtle for the top.')

  def update
    @devonshire = Devonshire.find(params[:id])

    respond_to do |format|
      if @devonshire.update_attributes(params[:devonshire])
---
SELECT * FROM "devonshires" WHERE ("devonshires"."id" = 1)
UPDATE "devonshires" SET "updated_at" = '2010-02-12 22:25:48', "description" = 'I didn''t take some photos of the neck headstock being glued and the veneer being glued onto the headstock face (I forgot to take them). But here the channel for the neck rod is routed. This will have a "Hot Rod" bi-directionally adjustable neck-rod.' WHERE "id" = 21

  def destroy
    @devonshire = Devonshire.find(params[:id])
    @devonshire.destroy
---
SELECT * FROM "devonshires" WHERE ("devonshires"."id" = 33)
DELETE FROM "devonshires" WHERE "id" = 33