app/controllers/guitar_pics_controller.rb

SELECT * FROM "guitar_pics"
---
  def index
    @guitar_pics = GuitarPic.all

SELECT * FROM "guitar_pics" LIMIT 4 OFFSET 0
---
  def publiclist

    @guitarpics = GuitarPic.paginate :page => params[:page], :per_page => 4

SELECT * FROM "guitar_pics" WHERE ("guitar_pics"."id" = 1)
---
  def show
    @guitar_pic = GuitarPic.find(params[:id])

INSERT INTO "guitar_pics" ("photo_file_size", "created_at", "title", "photo_file_name", "updated_at", "photo_content_type", "description") VALUES(25591, '2010-04-29 22:32:56', 'Saber Model, after first pore-filling and sanding', 'IMG_0247.JPG', '2010-04-29 22:32:56', 'image/jpeg', 'This guitar is a neck-thru-body design. The neck is purple-heart and cherry. The body is mahogany.
---
  def create
    @guitar_pic = GuitarPic.new(params[:guitar_pic])

    respond_to do |format|
      if @guitar_pic.save