app/controllers/project_pics_controller.rb

  def index

    session[:project_id] = params[:project_id]
    @project_pics = ProjectPic.find :all, :conditions => ["project_id = ?", session[:project_id]]
---
SELECT * FROM `project_pics` WHERE (project_id = '1')

  def show
    @project_pic = ProjectPic.find(params[:id])
---
SELECT * FROM `project_pics` WHERE (`project_pics`.`id` = 1)

  def create
    @project_pic = ProjectPic.new(params[:project_pic])

    respond_to do |format|
      if @project_pic.save
---
INSERT INTO `project_pics` (`name`, `created_at`, `photo_file_size`, `photo_file_name`, `updated_at`, `project_id`, `photo_content_type`, `description`) VALUES('', '2011-11-26 14:29:02', 210437, 'PB104303.JPG', '2011-11-26 14:29:02', NULL, 'image/jpeg', '')

  def destroy
    @project_pic = ProjectPic.find(params[:id])
    @project_pic.destroy
---
SELECT * FROM `project_pics` WHERE (`project_pics`.`id` = 6)
DELETE FROM `project_pics` WHERE `id` = 6