app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def publiclist
    @projects = Project.all
---
SELECT * FROM `projects`

  def publicshow
    @project = Project.find(params[:id])
    @project_pics = ProjectPic.find :all, :conditions => ["project_id = ?", params[:id]]
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `project_pics` WHERE (project_id = '1')

  def show
    @project = Project.find(params[:id])
    session[:project_id] = params[:id]
    @project_pics = ProjectPic.find :all, :conditions => ["project_id = ?", params[:id]]
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `project_pics` WHERE (project_id = '1')

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `client_location`, `date_complete`, `created_at`, `specs`, `updated_at`, `hours_to_build`) VALUES('18\" Archtop Jazz Guitar', '', '2011-11-08', '2011-11-25 20:32:25', '', '2011-11-25 20:32:25', 185)

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2011-11-28 14:51:34', `client_location` = 'New York City', `specs` = 'Sitka Spruce Top\r\nCurly Maple Back and Sides\r\nOne-piece maple neck\r\nEbony fingerboard\r\nEbony faceplate\r\nEbony bridge\r\nFloating humbucker pickup\r\n25\" scale fretboard\r\n12\" radius fretboard\r\nArt deco MOP/Abalone inlay on headstock\r\nDual Action Truss Rod\r\nAngel wing soundports in back with custom covers' WHERE `id` = 1